frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/APM32L0xx_StdPeriphDriver/src/apm32l0xx_lpuart.c
    if (request == LPUART_REQUEST_RXDFQ)
    {
        LPUART1->REQUEST_B.RXDFQ = BIT_SET;
    }

    if (request == LPUART_REQUEST_TXBFQ)
    {
        LPUART1->REQUEST_B.TXBFQ = BIT_SET;
    }
}

/*!
 * @brief       Enables the specified interrupts
 *
 * @param       interrupt:  Specifies the LPUART interrupts sources
 *                          The parameter can be one of following values:
 *                          @arg LPUART_INT_WAKEUP:  Wake up interrupt
 *                          @arg LPUART_INT_CMIE:    Character match interrupt
 *                          @arg LPUART_INT_CTSIE:   CTS change interrupt
 *                          @arg LPUART_INT_TXBEIE:  Tansmit Data Register empty interrupt
 *                          @arg LPUART_INT_TXCIE:   Transmission complete interrupt
 *                          @arg LPUART_INT_RXBNEIE: Receive Data register not empty interrupt
 *                          @arg LPUART_INT_IDLEIE:  Idle line detection interrupt
 *                          @arg LPUART_INT_PEIE:    Parity Error interrupt
 *                          @arg LPUART_INT_ERRIE:   Error interrupt
 *
 * @retval      None
 *
 */
void LPUART_EnableInterrupt(LPUART_INT_T interrupt)
{
    if ((interrupt == LPUART_INT_ERRIE ) | (interrupt == LPUART_INT_CTSIE) | (interrupt == LPUART_INT_WAKEUP))
    {
        LPUART1->CTRL3 |= (uint32_t)interrupt;
    }
    else
    {
        LPUART1->CTRL1 |= (uint32_t)interrupt;
    }
}

/*!
 * @brief       Disables the specified interrupts
 *
 * @param       interrupt:  Specifies the LPUART interrupts sources
 *                          The parameter can be one of following values:
 *                          @arg LPUART_INT_WAKEUP:  Wake up interrupt
 *                          @arg LPUART_INT_CMIE:    Character match interrupt
 *                          @arg LPUART_INT_CTSIE:   CTS change interrupt
 *                          @arg LPUART_INT_TXBEIE:  Tansmit Data Register empty interrupt
 *                          @arg LPUART_INT_TXCIE:   Transmission complete interrupt
 *                          @arg LPUART_INT_RXBNEIE: Receive Data register not empty interrupt
 *                          @arg LPUART_INT_IDLEIE:  Idle line detection interrupt
 *                          @arg LPUART_INT_PEIE:    Parity Error interrupt
 *                          @arg LPUART_INT_ERRIE:   Error interrupt
 *
 * @retval      None
 *
 */
void LPUART_DisableInterrupt(LPUART_INT_T interrupt)
{
    if ((interrupt == LPUART_INT_ERRIE ) | (interrupt == LPUART_INT_CTSIE) | (interrupt == LPUART_INT_WAKEUP))
    {
        LPUART1->CTRL3 &= (uint32_t)~interrupt;
    }
    else
    {
        LPUART1->CTRL1 &= (uint32_t)~interrupt;
    }
}

/*!
 * @brief       Read the specified LPUART interrupt flag
 *
 * @param       flag:   Specifies the LPUART interrupt flag to check
 *                      The parameter can be one of following values:
 *                      @arg LPUART_INT_FLAG_WAKEUP: Wake up interrupt flag
 *                      @arg LPUART_INT_FLAG_CMF:    Character match interrupt flag
 *                      @arg LPUART_INT_FLAG_CTSIF:  CTS interrupt fla
 *                      @arg LPUART_INT_FLAG_TXBE:   Transmit data register empty interrupt flag
 *                      @arg LPUART_INT_FLAG_TXC:    Transmission Complete interrupt flag
 *                      @arg LPUART_INT_FLAG_RXBNE:  Receive data buffer not empty interrupt flag
 *                      @arg LPUART_INT_FLAG_IDLE:   Idle Line detection interrupt flag
 *                      @arg LPUART_INT_FLAG_OVRE:   OverRun Error interrupt flag
 *                      @arg LPUART_INT_FLAG_NE:     Noise Error interrupt flag
 *                      @arg LPUART_INT_FLAG_FE:     Framing Error interrupt flag
 *                      @arg LPUART_INT_FLAG_PE:     Parity Error interrupt flag
 *
 * @retval      The new state of flag (SET or RESET)
 *
 */
uint8_t LPUART_ReadIntFlag(LPUART_INT_FLAG_T flag)
{
    uint32_t intEnable = 0;
    uint32_t intFlag = 0;

    if (flag & 0x0E)
    {
        intEnable = LPUART1->CTRL3_B.ERRIEN;
        intFlag = (LPUART1->STS) & flag;
    }
    else if (flag & 0xF0)
    {
        intEnable = (LPUART1->CTRL1) & flag;
        intFlag = (LPUART1->STS) & flag;
    }
    else if (flag & 0x01)
    {
        intEnable = LPUART1->CTRL1_B.PEIEN;
        intFlag = LPUART1->STS_B.PEFLG;
    }
    else if (flag & 0x200)
    {
        intEnable = LPUART1->CTRL3_B.CTSIEN;
        intFlag = LPUART1->STS_B.CTSFLG;
    }
    else if (flag & 0x20000)
    {
        intEnable = LPUART1->CTRL1_B.CMIEN;
        intFlag = LPUART1->STS_B.CMFLG;
    }
    else if (flag & 0x100000)
    {
        intEnable = LPUART1->CTRL3_B.WSMIEN;
        intFlag = LPUART1->STS_B.WSMFLG;
    }

    if (intFlag && intEnable)
    {
        return SET;
    }

    return RESET;
}

/*!
 * @brief       Clears the LPUART interrupt pending bits
 *
 * @param       flag:   Specifies the LPUART interrupt flag to clear
 *                      The parameter can be any combination following values:
 *                      @arg LPUART_INT_FLAG_WAKEUP: Wake up interrupt flag
 *                      @arg LPUART_INT_FLAG_CMF:    Character match interrupt flag
 *                      @arg LPUART_INT_FLAG_CTSIF:  CTS interrupt flag
 *                      @arg LPUART_INT_FLAG_TXC:    Transmission Complete interrupt flag
 *                      @arg LPUART_INT_FLAG_IDLE:   Idle Line detection interrupt flag
 *                      @arg LPUART_INT_FLAG_OVRE:   OverRun Error interrupt flag
 *                      @arg LPUART_INT_FLAG_NE:     Noise Error interrupt flag
 *                      @arg LPUART_INT_FLAG_FE:     Framing Error interrupt flag
 *                      @arg LPUART_INT_FLAG_PE:     Parity Error interrupt flag
 *
 * @retval      None
 *
 */
void LPUART_ClearIntFlag(LPUART_INT_FLAG_T flag)
{
    LPUART1->INTFCLR |= (uint32_t)flag;
}

/*!
 * @brief       Read the specified LPUART flag
 *
 * @param       flag:   Specifies the flag to check
 *                      The parameter can be one of following values:
 *                      @arg LPUART_FLAG_RXENACKF: Receive Enable Acknowledge Flag
 *                      @arg LPUART_FLAG_TXENACKF: Transmit Enable Acknowledge Flag
 *                      @arg LPUART_FLAG_WAKEUP: Wake Up from stop mode Flag
 *                      @arg LPUART_FLAG_RWF:    Send Break flag
 *                      @arg LPUART_FLAG_SBF:    Send Break flag
 *                      @arg LPUART_FLAG_CMF:    Character match flag
 *                      @arg LPUART_FLAG_BUSY:   Busy flag
 *                      @arg LPUART_FLAG_CTSF:   CTS Change flag
 *                      @arg LPUART_FLAG_CTSIF:  CTS interrupt flag
 *                      @arg LPUART_FLAG_TXBE:   Transmit data register empty flag
 *                      @arg LPUART_FLAG_TXC:    Transmission Complete flag
 *                      @arg LPUART_FLAG_RXBNE:  Receive data buffer not empty flag
 *                      @arg LPUART_FLAG_IDLEF:  Idle Line detection flag
 *                      @arg LPUART_FLAG_OVRE:   OverRun Error flag
 *                      @arg LPUART_FLAG_NEF:    Noise Error flag
 *                      @arg LPUART_FLAG_FEF:    Framing Error flag
 *                      @arg LPUART_FLAG_PEF:    Parity Error flag
 *
 * @retval      The new state of flag (SET or RESET)
 *
 */
uint8_t LPUART_ReadStatusFlag(LPUART_FLAG_T flag)
{
    if ((LPUART1->STS & (uint32_t)flag) != RESET)
    {
        return SET;
    }

    return RESET;
}

/*!
 * @brief       Clear the specified LPUART flag
 *
 * @param       flag:   Specifies the flag to clear
 *                      The parameter can be any combination of following values:
 *                      @arg LPUART_FLAG_WAKEUP: Wake Up from stop mode Flag
 *                      @arg LPUART_FLAG_CMF:    Character match flag
 *                      @arg LPUART_FLAG_CTSIF:  CTS interrupt flag
 *                      @arg LPUART_FLAG_TXC:    Transmission Complete flag
 *                      @arg LPUART_FLAG_IDLEF:  Idle Line detection flag
 *                      @arg LPUART_FLAG_OVRE:   OverRun Error flag
 *                      @arg LPUART_FLAG_NEF:    Noise Error flag
 *                      @arg LPUART_FLAG_FEF:    Framing Error flag
 *                      @arg LPUART_FLAG_PEF:    Parity Error flag
 *
 * @retval      Note
 *
 */
void LPUART_ClearStatusFlag(LPUART_FLAG_T flag)
{
    LPUART1->INTFCLR = (uint32_t)flag;
}

/**@} end of group LPUART_Fuctions*/
/**@} end of group LPUART_Driver*/
/**@} end of group Peripherals_Library*/
